import pandas as pd


data = {
    'Ученики' : ['Максим', 'Иван', 'Анна', 'Павел', 'Марина', 'Настя', 'Рома', 'Влад', 'Костя', 'Дима'],
    'Математика' : [5, 3, 5, 5, 4, 3, 5, 4, 5, 4],
    'Русский' : [3, 4, 4, 3, 5, 5, 3, 3, 4, 3],
    'Английский' : [5, 5, 4, 4, 3, 3, 4, 4, 3, 4],
    'Химия' : [3, 4, 4, 3, 3, 4, 3, 4, 3, 3],
    'Физика' : [4, 3, 5, 5, 4, 3, 5, 3, 4, 4]
}

df = pd.DataFrame(data)
df.set_index('Ученики', inplace=True)
print(df.head(5))

print()
print(f'Средняя оценка по математике {df['Математика'].mean()}')
print(f'Средняя оценка по русскому {df['Русский'].mean()}')
print(f'Средняя оценка по английскому {df['Английский'].mean()}')
print(f'Средняя оценка по химии {df['Химия'].mean()}')
print(f'Средняя оценка по физике {df['Физика'].mean()}')

print()
print(f'Медианная оценка по математике {df['Математика'].median()}')
print(f'Медианная оценка по русскому {df['Русский'].median()}')
print(f'Медианная оценка по английскому {df['Английский'].median()}')
print(f'Медианная оценка по химии {df['Химия'].median()}')
print(f'Медианная оценка по физике {df['Физика'].median()}')

Q1_math = df['Математика'].quantile(0.25)
Q3_math = df['Математика'].quantile(0.75)
IQR = Q3_math - Q1_math

print()
print(f'Квартиль 25% по математике равен: {Q1_math}')
print(f'Квартиль 75% по математике равен: {Q3_math}')
print(f'Межквартальный размах по математике равен: {IQR}')

print()
print(f'Стандартное отклонение по математике {df['Математика'].std()}')
print(f'Стандартное отклонение по русскому {df['Русский'].std()}')
print(f'Стандартное отклонение по английскому {df['Английский'].std()}')
print(f'Стандартное отклонение по химии {df['Химия'].std()}')
print(f'Стандартное отклонение по физике {df['Физика'].std()}')